###############################################################################
# Created by write_sdc
###############################################################################
current_design soc_ctrl_slave
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARADDR[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARBURST[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARBURST[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARID[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARID[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARID[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARID[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARLEN[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARLEN[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARLEN[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARLEN[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARLEN[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARLEN[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARLEN[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARLEN[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARPROT[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARPROT[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARPROT[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARSIZE[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARSIZE[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARSIZE[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARVALID}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWADDR[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWBURST[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWBURST[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWID[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWID[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWID[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWID[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWLEN[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWLEN[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWLEN[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWLEN[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWLEN[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWLEN[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWLEN[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWLEN[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWPROT[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWPROT[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWPROT[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWSIZE[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWSIZE[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWSIZE[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWVALID}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_BREADY}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RREADY}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WDATA[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WLAST}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WSTRB[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WSTRB[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WSTRB[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WSTRB[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WVALID}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ascon_irq}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_hits[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_misses[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcache_writes[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpio_irq}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_hits[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {icache_misses[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spi_irq}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {timer_irq}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {uart_irq}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdt_irq}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_ARREADY}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_AWREADY}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_BID[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_BID[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_BID[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_BID[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_BRESP[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_BRESP[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_BVALID}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RDATA[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RID[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RID[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RID[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RID[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RLAST}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RRESP[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RRESP[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_RVALID}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {S_AXI_WREADY}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {irq_out}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {soft_rst_pulse}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {S_AXI_ARREADY}]
set_load -pin_load 0.0334 [get_ports {S_AXI_AWREADY}]
set_load -pin_load 0.0334 [get_ports {S_AXI_BVALID}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RLAST}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RVALID}]
set_load -pin_load 0.0334 [get_ports {S_AXI_WREADY}]
set_load -pin_load 0.0334 [get_ports {irq_out}]
set_load -pin_load 0.0334 [get_ports {soft_rst_pulse}]
set_load -pin_load 0.0334 [get_ports {S_AXI_BID[3]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_BID[2]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_BID[1]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_BID[0]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_BRESP[1]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_BRESP[0]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[31]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[30]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[29]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[28]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[27]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[26]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[25]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[24]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[23]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[22]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[21]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[20]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[19]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[18]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[17]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[16]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[15]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[14]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[13]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[12]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[11]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[10]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[9]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[8]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[7]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[6]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[5]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[4]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[3]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[2]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[1]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RDATA[0]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RID[3]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RID[2]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RID[1]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RID[0]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RRESP[1]}]
set_load -pin_load 0.0334 [get_ports {S_AXI_RRESP[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARVALID}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWVALID}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_BREADY}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_RREADY}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WLAST}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WVALID}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ascon_irq}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_irq}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_irq}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {timer_irq}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {uart_irq}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdt_irq}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARADDR[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARBURST[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARBURST[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARID[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARID[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARID[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARID[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARLEN[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARLEN[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARLEN[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARLEN[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARLEN[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARLEN[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARLEN[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARLEN[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARPROT[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARPROT[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARPROT[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARSIZE[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARSIZE[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_ARSIZE[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWADDR[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWBURST[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWBURST[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWID[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWID[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWID[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWID[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWLEN[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWLEN[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWLEN[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWLEN[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWLEN[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWLEN[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWLEN[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWLEN[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWPROT[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWPROT[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWPROT[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWSIZE[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWSIZE[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_AWSIZE[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WDATA[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WSTRB[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WSTRB[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WSTRB[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S_AXI_WSTRB[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_hits[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_misses[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcache_writes[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_hits[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {icache_misses[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
