# ####################################################################

#  Created by Genus(TM) Synthesis Solution 23.10-p004_1 on Fri Feb 13 19:35:33 +07 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design inst_mem

set_case_analysis 0 [get_pins u_ram_macro/B_BIST_MEN]
set_case_analysis 0 [get_pins u_ram_macro/B_BIST_REN]
set_case_analysis 0 [get_pins u_ram_macro/B_BIST_WEN]
set_case_analysis 0 [get_pins u_ram_macro/B_BIST_EN]
set_case_analysis 0 [get_pins u_ram_macro/A_BIST_MEN]
set_case_analysis 0 [get_pins u_ram_macro/A_BIST_REN]
set_case_analysis 0 [get_pins u_ram_macro/A_BIST_WEN]
set_case_analysis 0 [get_pins u_ram_macro/A_BIST_EN]
create_clock -name "VCLK" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_false_path -from [get_ports rst_n]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[31]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[30]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[29]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[28]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[27]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[26]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[25]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[24]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[23]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[22]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[21]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[20]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[19]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[18]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[17]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[16]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[15]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[14]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[13]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[12]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[11]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[10]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[9]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[8]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[7]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[6]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[5]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[4]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[3]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[2]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[1]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {PC[0]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[31]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[30]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[29]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[28]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[27]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[26]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[25]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[24]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[23]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[22]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[21]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[20]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[19]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[18]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[17]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[16]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[15]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[14]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[13]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[12]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[11]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[10]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[9]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[8]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[7]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[6]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[5]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[4]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[3]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[2]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[1]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_addr[0]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_len[7]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_len[6]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_len[5]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_len[4]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_len[3]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_len[2]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_len[1]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_len[0]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports burst_req]
set_input_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports burst_ready]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[31]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[30]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[29]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[28]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[27]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[26]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[25]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[24]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[23]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[22]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[21]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[20]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[19]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[18]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[17]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[16]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[15]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[14]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[13]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[12]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[11]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[10]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[9]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[8]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[7]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[6]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[5]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[4]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[3]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[2]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[1]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {PC[0]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[31]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[30]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[29]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[28]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[27]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[26]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[25]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[24]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[23]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[22]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[21]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[20]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[19]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[18]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[17]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[16]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[15]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[14]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[13]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[12]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[11]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[10]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[9]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[8]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[7]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[6]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[5]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[4]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[3]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[2]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[1]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_addr[0]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_len[7]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_len[6]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_len[5]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_len[4]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_len[3]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_len[2]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_len[1]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_len[0]}]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports burst_req]
set_input_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports burst_ready]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[31]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[30]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[29]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[28]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[27]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[26]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[25]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[24]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[23]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[22]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[21]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[20]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[19]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[18]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[17]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[16]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[15]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[14]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[13]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[12]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[11]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[10]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[9]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[8]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[7]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[6]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[5]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[4]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[3]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[2]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[1]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {Instruction_Code[0]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[31]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[30]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[29]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[28]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[27]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[26]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[25]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[24]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[23]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[22]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[21]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[20]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[19]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[18]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[17]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[16]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[15]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[14]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[13]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[12]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[11]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[10]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[9]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[8]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[7]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[6]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[5]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[4]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[3]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[2]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[1]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports {burst_data[0]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports burst_valid]
set_output_delay -clock [get_clocks VCLK] -add_delay -max 4.0 [get_ports burst_last]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[31]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[30]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[29]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[28]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[27]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[26]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[25]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[24]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[23]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[22]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[21]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[20]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[19]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[18]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[17]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[16]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[15]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[14]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[13]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[12]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[11]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[10]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[9]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[8]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[7]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[6]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[5]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[4]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[3]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[2]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[1]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {Instruction_Code[0]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[31]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[30]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[29]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[28]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[27]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[26]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[25]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[24]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[23]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[22]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[21]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[20]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[19]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[18]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[17]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[16]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[15]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[14]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[13]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[12]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[11]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[10]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[9]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[8]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[7]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[6]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[5]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[4]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[3]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[2]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[1]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports {burst_data[0]}]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports burst_valid]
set_output_delay -clock [get_clocks VCLK] -add_delay -min 0.5 [get_ports burst_last]
set_max_transition 0.2 [current_design]
set_clock_uncertainty -setup 0.1 [get_clocks VCLK]
set_clock_uncertainty -hold 0.1 [get_clocks VCLK]
